<meta charset="utf-8">
<link href="https://recursos.clubedomalte.com.br/Handlers/ResourceHandler.ashx?base=c&amp;arquivos=bp-desktop.css" rel="stylesheet" />
<link href="https://fonts.googleapis.com/css?family=Oswald:300,400,700|Lato:100,300,400,700,900" rel="stylesheet" type="text/css" /><script type='text/javascript' src="https://recursos.clubedomalte.com.br/Handlers/ResourceHandler.ashx?base=c&arquivos=bp.js"></script>
<title></title>
<div id="wrapper">
<section id="faq">
<h3 style="text-align: center; padding: 20px; font-size: 30px; color: #737B84;">Perguntas Frequentes - Clube do Malte</h3>

<div class="container3 perguntas texto-marrom"><input placeholder="Escreva aqui uma palavra chave (exemplo: frete, cerveja, cancelar, etc) " type="text" value="" />
<ul>
	<li id="faq-1">
	<h3><a href="#faq-1" title="Clique para abrir a resposta">1) O QUE PRECISO FAZER PARA COMPRAR NO CLUBE DO MALTE?</a></h3>

	<div>
	<p>Antes de fazer sua primeira compra, &eacute; necess&aacute;rio realizar seu cadastro em nosso site, preenchendo os campos solicitados na op&ccedil;&atilde;o <a href="https://checkout.clubedomalte.com.br/Cadastro">&ldquo;REGISTRE-SE&rdquo;</a>.</p>

	<p><strong>Aten&ccedil;&atilde;o:</strong> Os campos marcados com * s&atilde;o de preenchimento obrigat&oacute;rio. Voc&ecirc; dever&aacute; criar uma senha, que ser&aacute; utilizada em todas as suas compras no Clube do Malte. Guarde-a com cuidado.<br />
	Se voc&ecirc; j&aacute; possui cadastro, basta fazer seu login e realizar sua compra.</p>

	<p>OBS: &Eacute; muito importante que mantenha seus dados de cadastro sempre atualizadoS, pois ser&aacute; atrav&eacute;s das informa&ccedil;&otilde;es fornecidas em seu cadastro (e-mail, telefone*&sup1;, etc) que entraremos em contato, quando necess&aacute;rio.</p>
	&nbsp;

	<p style="font-size:12px;">*&sup1;Por seguran&ccedil;a, o Clube do Malte se reserva ao direito de gravar as liga&ccedil;&otilde;es telef&ocirc;nicas.</p>
	</div>
	</li>
	<li id="faq-2">
	<h3><a href="#faq-2" title="Clique para abrir a resposta">2) COMO FA&Ccedil;O PARA CONSEGUIR VANTAGENS EM MINHAS COMPRAS?</a></h3>

	<div>
	<p>Tornando-se nosso assinante, voc&ecirc; garante mais pontos no programa <a href="https://www.clubedomalte.com.br/cashback">Cashback</a>, em todas as compras que realizar em nosso site.</p>
	</div>
	</li>
	<li id="faq-3">
	<h3><a href="#faq-3" title="Clique para abrir a resposta">3) POSSO ESCOLHER ONDE RECEBER O PEDIDO?</a></h3>

	<div>
	<p>Claro! Voc&ecirc; pode escolher onde acha melhor receber seu pedido ou, inclusive, escolher outro endere&ccedil;o para entrega. Antes de finalizar sua compra, basta cadastrar o endere&ccedil;o onde o pedido dever&aacute; ser entregue. Se for um presente, basta adicionar o novo endere&ccedil;o onde esse pedido dever&aacute; ser entregue. Caso queira mandar uma mensagem ao seu presenteado, assim que realizar, dever&aacute; entrar em contato conosco atrav&eacute;s de nossa Central de atendimento, e assim colocamos uma carta junto com o pedido.</p>

	<p><strong>OBS:</strong> Caso queira mudar definitivamente o seu endere&ccedil;o de entrega, se o pedido ainda n&atilde;o foi feito, voc&ecirc; deve acessar o link &ldquo;Meu Cadastro&rdquo;, na op&ccedil;&atilde;o &ldquo;Meus Endere&ccedil;os&rdquo; e realizar a altera&ccedil;&atilde;o.</p>
	</div>
	</li>
	<li id="faq-4">
	<h3><a href="#faq-4" title="Clique para abrir a resposta">4) COMO &Eacute; FEITO O PAGAMENTO?</a></h3>

	<div>
	<p>As compras realizada no site podem ser pagas com cart&atilde;o de cr&eacute;dito, boleto banc&aacute;rio e transfer&ecirc;ncia (Fast Cash) - estes dois &uacute;ltimos v&aacute;lidos somente para produtos da loja. O Fast Cash &eacute; a possibilidade de realizar a transfer&ecirc;ncia acessando diretamente seu internet banking ou a realiza&ccedil;&atilde;o do dep&oacute;sito e posterior comprova&ccedil;&atilde;o diretamente em seu pedido.</p>

	<p>Aceitamos as seguintes bandeiras de cart&atilde;o de cr&eacute;dito:</p>

	<p><strong>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Visa</strong></p>

	<p><strong>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Mastercard</strong></p>

	<p><strong>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; American Express</strong></p>

	<p><strong>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Elo</strong></p>

	<p><strong>&middot;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Diners Club</strong></p>

	<p>As compras da loja podem ser parceladas em at&eacute; 2x sem juros no cart&atilde;o e em at&eacute; 6x com acr&eacute;scimo de juros. O pagamento das assinaturas acontece mensalmente de forma autom&aacute;tica por cart&atilde;o de cr&eacute;dito.</p>

	<p>Os dados de cart&atilde;o de cr&eacute;dito n&atilde;o ficam armazenados em nenhum sistema interno. Os mesmos s&atilde;o criptografados e enviados ao nosso sistema de pagamento, que faz toda a comunica&ccedil;&atilde;o e cobran&ccedil;a com a administradora do cart&atilde;o de forma segura, conforme regulamenta&ccedil;&atilde;o internacional que rege esse tipo de transa&ccedil;&atilde;o.</p>

	<p>Devido &agrave; recorr&ecirc;ncia mensal no pagamento da assinatura, n&atilde;o &eacute; permitido que o mesmo seja realizado com cart&atilde;o virtual, pois esse possui curto prazo de validade do c&oacute;digo de seguran&ccedil;a, o que leva ao n&atilde;o processamento dos pagamentos dos meses seguintes da assinatura.</p>

	<p><strong>IMPORTANTE:</strong> Ap&oacute;s fechar seu pedido, n&atilde;o ser&aacute; poss&iacute;vel nenhuma altera&ccedil;&atilde;o (n&atilde;o &eacute; poss&iacute;vel alterar os itens do pedido, o endere&ccedil;o, tipo de frete e nem forma de pagamento). Ap&oacute;s escolher a forma de pagamento, clique no bot&atilde;o &quot;Fechar Pedido&quot;. Voc&ecirc; receber&aacute; um e-mail informando todos os dados do seu pedido.</p>

	<p><strong>OBS.:</strong> Com pagamento via boleto, voc&ecirc; garante 3% de desconto em sua compra.</p>
	</div>
	</li>
	<li id="faq-5">
	<h3><a href="#faq-5" title="Clique para abrir a resposta">5) POSSO PARCELAR MINHA COMPRA?</a></h3>

	<div>
	<p>As compras da loja podem ser parceladas em at&eacute; 2x sem juros no cart&atilde;o e em at&eacute; 6x com acr&eacute;scimo de juros. O pagamento das assinaturas acontece mensalmente de forma autom&aacute;tica por cart&atilde;o de cr&eacute;dito.</p>
	</div>
	</li>
	<li id="faq-6">
	<h3><a href="#faq-6" title="Clique para abrir a resposta">6) COMO S&Atilde;O REALIZADOS OS ENVIOS?</a></h3>

	<div>
	<p>As op&ccedil;&otilde;es de frete dispon&iacute;veis variam de acordo com a regi&atilde;o de entrega. O seu pedido ser&aacute; enviado pelo tipo de frete escolhido no momento da compra.</p>

	<p><strong>OBS:</strong> Os Correios se reservam ao direito de, por algum motivo pr&eacute;-estabelecido internamente, n&atilde;o efetuar a entrega diretamente no endere&ccedil;o indicado, deixando a encomenda dispon&iacute;vel para retirada na ag&ecirc;ncia mais pr&oacute;xima. Por isso, pedimos que acompanhe constantemente seu rastreio e, caso necess&aacute;rio, siga as instru&ccedil;&otilde;es indicadas.</p>
	</div>
	</li>
	<li id="faq-7">
	<h3><a href="#faq-7" title="Clique para abrir a resposta">7) COMO &Eacute; A POL&Iacute;TICA DE FRETE?</a></h3>

	<div><!-- OLD TEXT --><!--
  <p>O frete ser&aacute; calculado de acordo com o peso e local de entrega desejado. Voc&ecirc; pode calcular o custo do frete para o endere&ccedil;o desejado, assim que inserir o CEP, no in&iacute;cio do processo de compra. Os prazos variam de acordo com o endere&ccedil;o e op&ccedil;&atilde;o de frete escolhida. Voc&ecirc; pode consultar os prazos de entrega para sua regi&atilde;o em nossa <a href="http://www.clubedomalte.com.br/politica-de-frete">Pol&iacute;tica de Fretes</a>.</p>

  <p><strong>OBS:</strong> O valor tamb&eacute;m varia de acordo com o tipo de frete que escolher.</p>

  <p><strong>Importante:</strong> O prazo de entrega come&ccedil;a a contar ap&oacute;s o pedido ser enviado. Voc&ecirc; pode acompanhar as mudan&ccedil;as de status do seu pedido em sua &aacute;rea restrita, no nosso site. Ap&oacute;s o pack ser enviado ficar&aacute; disponivel o c&oacute;digo de rastreio, para que possa acompanhar sua entrega.</p>

  <p>Se voc&ecirc; possui pedidos SMART vinculados ao seu Beer Pack, o mesmo poder&aacute; ser despachado at&eacute; o dia 20.</p>
  --><!-- NEW TEXT -->
	<p>O frete ser&aacute; calculado de acordo com o peso e local de entrega desejado. Voc&ecirc; pode calcular o custo do frete para o endere&ccedil;o desejado antes de finalizar seu pedido.</p>

	<p>Os valores e prazos variam de acordo com o endere&ccedil;o e op&ccedil;&atilde;o de frete escolhida. Para assinaturas de Beer Pack, os valores poder&atilde;o sofrer altera&ccedil;&otilde;es sem aviso pr&eacute;vio.</p>

	<p><strong>Importante:</strong> O prazo de entrega come&ccedil;a a contar ap&oacute;s o pedido ser enviado. Voc&ecirc; pode acompanhar as mudan&ccedil;as de status do seu pedido em sua &aacute;rea restrita, no nosso site. Ap&oacute;s seu pedido ou Beer pack ser enviado ficar&aacute; dispon&iacute;vel o c&oacute;digo de rastreio, para que possa acompanhar sua entrega.</p>

	<p>Devido a Pol&iacute;tica dos Correios, para as &aacute;reas consideradas de risco, os Correios podem n&atilde;o realizar a entrega, ficando o material dispon&iacute;vel para a retirada na ag&ecirc;ncia.</p>
	</div>
	</li>
	<li id="faq-8">
	<h3><a href="#faq-8" title="Clique para abrir a resposta">8) &Eacute; POSS&Iacute;VEL ENVIAR OUTROS PRODUTOS COMPRADOS NO SITE COM O PACK DA MINHA ASSINATURA?</a></h3>

	<div>
	<p>Sim, &eacute; poss&iacute;vel enviar outros produtos adquiridos em nosso site junto a seu Beer Pack, atrav&eacute;s do frete Smart. Atente-se a data das compras com frete Smart, pois caso seu pack j&aacute; esteja em produ&ccedil;&atilde;o, seu pedido pode ser enviado s&oacute; no pack subsequente. O custo para o envio dos itens extras junto ao pack da assinatura, ser&aacute; gr&aacute;tis ou proporcional.</p>

	<p>Para que o seu pedido smart acompanhe o seu pack do m&ecirc;s seguinte, a compra precisa ser faturada ate o dia 30 de cada m&ecirc;s, caso contr&aacute;rio este pedido ir&aacute; acompanhar o pack do outro m&ecirc;s somente.</p>
	</div>
	</li>
	<li id="faq-9">
	<h3><a href="#faq-9" title="Clique para abrir a resposta">9) COMO FA&Ccedil;O PARA RASTREAR MEU PEDIDO?</a></h3>

	<div>
	<p>Voc&ecirc; pode acompanhar todos os seus pedido assim como as mudan&ccedil;as de status em sua &aacute;rea restrita, no nosso site. Acesse nosso site com seu login e senha e clique na op&ccedil;&otilde;es &ldquo;Meus Pedido&rdquo;. Na sequ&ecirc;ncia, clique no pedido que deseja verificar, todas as informa&ccedil;&otilde;es de status bem como o c&oacute;digo de rastreio estar&atilde;o disponiveis nessa &aacute;rea.</p>

	<p><strong>OBS:</strong> S&oacute; ser&aacute; possivel acompanhar o rastreio, ap&oacute;s seu pedido estar com status de enviado.</p>
	</div>
	</li>
	<li id="faq-10">
	<h3><a href="#faq-10" title="Clique para abrir a resposta">10) SOU DE CURITIBA, QUAL &Eacute; O PRAZO PARA EU FAZER A RETIRADA DO MEU PEDIDO NO ESTOQUE?</a></h3>

	<div>
	<p>Se voc&ecirc; &eacute; de Curitiba e optou por retirar seu pedido em nosso estoque, o prazo m&aacute;ximo de expedi&ccedil;&atilde;o do pedido e libera&ccedil;&atilde;o para retirada &eacute; de at&eacute; 72 horas &uacute;teis, ap&oacute;s confirma&ccedil;&atilde;o de pagamento. Se preferir acompanhar em sua &aacute;rea restrita no nosso site, assim que o status do pedido constar como &quot;Enviado&quot;, ele estar&aacute; dispon&iacute;vel para retirada, que deve ser feita mediante apresenta&ccedil;&atilde;o de documento. Ap&oacute;s liberado voc&ecirc; deve efetuar a retirada do pedido no prazo de 10 dias.</p>

	<p><strong>Importante:</strong> Caso n&atilde;o realize a retirada no prazo mencionado (10 dias), os itens ser&atilde;o reintegrados ao nosso estoque.</p>
	</div>
	</li>
	<li id="faq-11">
	<h3><a href="#faq-11" title="Clique para abrir a resposta">11) SE EU ESQUECER A MINHA SENHA, COMO FA&Ccedil;O PARA RECUPER&Aacute;-LA?</a></h3>

	<div>
	<p>Nesse caso, basta que voc&ecirc; acesse o site, insira seu e-mail na p&aacute;gina de login e logo a baixo, clique na op&ccedil;&atilde;o solicite recebe-la por e-email. Desse modo, ser&aacute; enviando um e-mail para voc&ecirc; redefinir sua senha.</p>
	</div>
	</li>
	<li id="faq-12">
	<h3><a href="#faq-12" title="Clique para abrir a resposta">12) O QUE FA&Ccedil;O SE DER ALGUM PROBLEMA COM MEU PEDIDO?</a></h3>

	<div>
	<p><strong>- Atraso no recebimento:</strong><br />
	Primeiramente certifique-se quanto ao prazo de entrega para o endere&ccedil;o indicado para entrega. Para conferir clique <a href="http://www.clubedomalte.com.br/politica-de-frete">aqui</a>.<br />
	Caso j&aacute; esteja extrapolado o seu prazo de entrega, entre em contato conosco, atrav&eacute;s da nossa Central de Atendimentos.</p>

	<p>&nbsp;</p>

	<p><strong>- Avaria ou viola&ccedil;&atilde;o no produto/embalagem:</strong><br />
	Os produtos s&atilde;o enviados em caixas mais resistentes e com colmeias separadoras, para que n&atilde;o se choquem um com o outro. Por&eacute;m nosso produto &eacute; fr&aacute;gil e infelizmente &agrave;s vezes podem sofrer avarias. Caso seja constatado alguma avaria em seu pedido, pedimos que proceda da seguinte forma:</p>

	<ul>
		<li>a) N&atilde;o recuse a mercadoria. Mesmo percebendo a avaria receba o produto, pois a possibilidade de avaria total da sua caixa &eacute; pouco prov&aacute;vel e, nesse caso, voc&ecirc; pode aproveitar os demais itens de sua compra, enquanto solucionamos a avaria para voc&ecirc;. Assim que receber a mercadoria fa&ccedil;a uma ressalva no protocolo de recebimento da transportadora, relatando que recebeu o pedido com avaria.</li>
		<li>b) Abra sua caixa com muito cuidado e verifique o que avariou.</li>
		<li>c) Tire fotos dos produtos avariados em sua caixa e envie, em at&eacute; 72h ap&oacute;s o recebimento, para o nosso canal de atendimento pelo endere&ccedil;o de e-mail faleconosco@clubedomalte.com.br, relatando quais produtos sofreram a avaria.</li>
	</ul>

	<p>Vamos providenciar a melhor forma de ressarcimento pra voc&ecirc;, pode ficar tranquilo em rela&ccedil;&atilde;o a isso. Seu e-mail ser&aacute; respondido em at&eacute; 72 horas &uacute;teis.</p>

	<p><strong>- Indisponibilidade de estoque</strong><br />
	Caso, por algum motivo, tenhamos indisponibilidade de estoque de algum item de seu pedido, o Clube do Malte, tem o dever de entrar em contato com o cliente informando o ocorrido e providenciar a melhor forma de ressarcimento. Nesse caso o ressarcimento poder&aacute; ocorrer atrav&eacute;s de Voucher, estorno ou troca por algum outro item de nossa loja.</p>
	</div>
	</li>
	<li id="faq-13">
	<h3><a href="#faq-13" title="Clique para abrir a resposta">13) POSSO TROCAR OU DEVOLVER MEU PEDIDO?</a></h3>

	<div>
	<p>Os produtos comprados no Clube do Malte poder&atilde;o ser trocados num prazo de 7 (sete) dias ap&oacute;s o recebimento. A troca somente ser&aacute; realizada se o produto estiver na embalagem original, devidamente lacrado e em perfeito estado.</p>
	</div>
	</li>
	<li id="faq-14">
	<h3><a href="#faq-14" title="Clique para abrir a resposta">14) QUAIS S&Atilde;O OS MOTIVOS PELOS QUAIS POSSO TROCAR OU DEVOLVER MEU PEDIDO?</a></h3>

	<div>
	<p><strong>Avaria:</strong> Em caso de avaria pedimos que n&atilde;o recuse a mercadoria e siga conforme instru&ccedil;&otilde;es descritas no t&oacute;pico 13, no item &quot;Avaria ou viola&ccedil;&atilde;o no produto/embalagem&quot;.</p>

	<p><strong>Desist&ecirc;ncia:</strong> Caso desista de sua compra, ap&oacute;s a mesma ter sido enviada, pedimos que fa&ccedil;a contato conosco e recuse o recebimento. Caso j&aacute; tenha recebido, mantenha a embalagem lacrada, em perfeito estado e fa&ccedil;a contato (em at&eacute; 7 dias) solicitando a coleta.</p>

	<p><strong>Defeito no produto:</strong> Em caso de defeito, voc&ecirc; dever&aacute; entrar em contato diretamente com o nosso servi&ccedil;o de atendimento ao cliente pelo telefone*&sup1; (41) 3029-0077, ou atrav&eacute;s da nossa Central de Atendimentos pelo e-mail faleconosco@clubedomalte.com.br. O prazo dado para que o cliente informe o recebimento de um produto com defeito &eacute; de at&eacute; 72 horas, ou seja, 3 (tr&ecirc;s) dias &uacute;teis, a contar do recebimento da encomenda. Nesse caso dever&aacute; seguir instru&ccedil;&otilde;es de nosso servi&ccedil;o de atendimento, conforme contato pr&eacute;-estabelecido.</p>

	<p><strong>Erro de envio:</strong> Caso tenha recebido um produto diferente do que foi solicitado, voc&ecirc; dever&aacute; entrar em contato atrav&eacute;s da nossa Central de Atendimentos, dentro de 7 dias, a contar da data do recebimento, comunicando imediatamente o fato, para que possamos providenciar a troca.</p>
	&nbsp;

	<p style="font-size:12px;">*&sup1;Por seguran&ccedil;a, o Clube do Malte se reserva ao direito de gravar as liga&ccedil;&otilde;es telef&ocirc;nicas.</p>
	</div>
	</li>
	<li id="faq-15">
	<h3><a href="#faq-15" title="Clique para abrir a resposta">15) QUAL &Eacute; O PRAZO PARA SOLICITAR A TROCA OU DEVOLU&Ccedil;&Atilde;O?</a></h3>

	<div>
	<p>Para todos os motivos citados acima, o prazo para solicitar o procedimento de troca ou devolu&ccedil;&atilde;o &eacute; de 7 (sete) dias.</p>
	</div>
	</li>
	<li id="faq-16">
	<h3><a href="#faq-16" title="Clique para abrir a resposta">16) PARA DESIST&Ecirc;NCIA, COMO FUNCIONA O REEMBOLSO DO VALOR DO PRODUTO?</a></h3>

	<div>
	<p>Poder&aacute; ser feito o reembolso do valor dos produtos, excluindo-se o valor cobrado pelo frete de envio e de retorno, da seguinte forma: ser&aacute; solicitado o estorno &agrave; administradora do cart&atilde;o. Dependendo do vencimento da fatura, o cr&eacute;dito pode n&atilde;o constar na mesma fatura. Na maioria das vezes &eacute; estornada apenas na pr&oacute;xima fatura. O estorno ser&aacute; efetuado conforme o n&uacute;mero de parcelas em que a compra foi paga. Caso o pagamento do pedido tenha sido realizado por boleto, transferencia ou dep&oacute;sito, faremos o estorno atrav&eacute;s de dep&oacute;sito banc&aacute;rio diretamente na conta do cliente, ap&oacute;s contato pr&eacute; estabelecido com nossao Central de Atendimento.</p>
	</div>
	</li>
	<li id="faq-17">
	<h3><a href="#faq-17" title="Clique para abrir a resposta">17) EM CASO DE TROCA, COMO SER&Aacute; REALIZADA?</a></h3>

	<div>
	<ul>
		<li>a) Caso o novo produto escolhido pelo cliente tenha um custo superior, ao valor do pedido, esta diferen&ccedil;a poder&aacute; ser paga por transfer&ecirc;ncia banc&aacute;ria ou dep&oacute;sito. Tamb&eacute;m dever&aacute; ser pago o valor do frete referente ao envio do novo produto.</li>
		<li>b) Se o produto indicado para a troca for mais barato, ser&aacute; feita a devolu&ccedil;&atilde;o do valor desta diferen&ccedil;a atrav&eacute;s de dep&oacute;sito banc&aacute;rio diretamente na conta do cliente ou enviaremos um voucher para utilizar em uma pr&oacute;xima compra.</li>
	</ul>
	</div>
	</li>
</ul>

<div class="faq__notfound">
<h3>Nada encontrado. Caso tenha alguma outra d&uacute;vida, fique a vontade para entrar em contato conosco por nossa Central de Atendimentos</h3>
</div>
</div>
</section>
</div>
<script src="https://ajax.googleapis.com/ajax/libs/jquery/3.1.1/jquery.min.js"></script><script>
    'use strict';


    // search & highlight

    ;
    (function($, window, document, undefined) {
      var $container = $('.perguntas');
      if (!$container.length) return true;

      var $input = $container.find('input'),
        $notfound = $container.find('.faq__notfound'),
        $items = $container.find('> ul > li'),
        $item = $(),
        itemsIndexed = [];

      $items.each(function() {
        itemsIndexed.push($(this).text().replace(/\s{2,}/g, ' ').toLowerCase());
      });

      $input.on('keyup', function(e) {
        if (e.keyCode == 13) // enter
        {
          $input.trigger('blur');
          return true;
        }

        $items.each(function() {
          $item = $(this);
          $item.html($item.html().replace(/<span class="highlight">([^<]+)<\/span>/gi, '$1'));
        });

        var searchVal = $.trim($input.val()).toLowerCase();
        if (searchVal.length) {
          for (var i in itemsIndexed) {
            $item = $items.eq(i);
            if (itemsIndexed[i].indexOf(searchVal) != -1)
              $item.removeClass('is-hidden').html($item.html().replace(new RegExp(searchVal + '(?!([^<]+)?>)', 'gi'), '<span class="highlight">$&</span>')).addClass('possui-high');
            else
              $item.addClass('is-hidden').removeClass('possui-high');
          }
        } else $items.removeClass('is-hidden').removeClass('possui-high');

        $notfound.toggleClass('is-visible', $items.not('.is-hidden').length == 0);
      });
    })(jQuery, window, document);


    // toggling items on title press

    ;
    (function($, window, document, undefined) {
      $(document).on('click', '.perguntas h3 a', function(e) {
        e.preventDefault();
        $(this).parents('li').toggleClass('is-active');
      });
    })(jQuery, window, document);


    // auto-show item content when show results reduces to single

    ;
    (function($, window, document, undefined) {
      var $container = $('.perguntas');
      if (!$container.length) return true;

      var $input = $container.find('input'),
        $items = $container.find('> ul > li'),
        $item = $();

      $input.on('keyup', function() {
        $item = $items.not('.is-hidden');
        if ($item.length == 1)
          $item.addClass('js--autoshown is-active');
        else
          $items.filter('.js--autoshown').removeClass('js--autoshown is-active');
      });
    })(jQuery, window, document);
  </script>